#include <iostream>

using namespace std;

int main() {
    int M, N;
    
    // Ввод размеров массивов M и N
    cout << "Введите размер массива А (M): ";
    cin >> M;
    cout << "Введите размер массива B (N): ";
    cin >> N;
    
    // Создаем массивы A и B
    int A[M];
    int B[N];

    // Ввод элементов массива A
    cout << "Введите элементы массива A:" << endl;
    for (int i = 0; i < M; ++i) {
        cin >> A[i];
    }

    // Ввод элементов массива B
    cout << "Введите элементы массива B:" << endl;
    for (int i = 0; i < N; ++i) {
        cin >> B[i];
    }

    // Создаем третий массив для хранения общих элементов
    int C[M + N]; // Максимальный размер - сумма размеров A и B

    // Переменные для отслеживания индексов в массивах A и B
    int iA = 0;
    int iB = 0;
    int iC = 0;

    // Поиск и сохранение общих элементов без повторений
    while (iA < M && iB < N) {
        if (A[iA] < B[iB]) {
            iA++;
        } else if (A[iA] > B[iB]) {
            iB++;
        } else {
            // Элементы равны и добавляются в массив C
            C[iC++] = A[iA];
            iA++;
            iB++;
        }
    }

    // Вывод общих элементов
    cout << "Общие элементы массивов A и B:" << endl;
    for (int i = 0; i < iC; ++i) {
        cout << C[i] << " ";
    }

    cout << endl;

    return 0;
}
