#include <iostream>

using namespace std;

int main() {
    int M, N;
    
    // Ввод размеров массивов M и N
    cout << "Введите размер массива А (M): ";
    cin >> M;
    cout << "Введите размер массива B (N): ";
    cin >> N;
    
    // Создаем массивы A и B
    int A[M];
    int B[N];

    // Ввод элементов массива A
    cout << "Введите элементы массива A:" << endl;
    for (int i = 0; i < M; ++i) {
        cin >> A[i];
    }

    // Ввод элементов массива B
    cout << "Введите элементы массива B:" << endl;
    for (int i = 0; i < N; ++i) {
        cin >> B[i];
    }

    // Создаем третий массив для хранения элементов A, которые не входят в B
    int C[M]; // Максимальный размер - размер массива A

    // Инициализируем индекс для массива C
    int iC = 0;

    // Проверяем каждый элемент массива A
    for (int i = 0; i < M; ++i) {
        bool isDuplicate = false;

        // Проверяем, есть ли элемент A[i] в массиве B
        for (int j = 0; j < N; ++j) {
            if (A[i] == B[j]) {
                isDuplicate = true;
                break;
            }
        }

        // Если элемент не является дубликатом, добавляем его в массив C
        if (!isDuplicate) {
            C[iC++] = A[i];
        }
    }

    // Выводим элементы массива C
    cout << "Элементы массива A, которые не входят в B:" << endl;
    for (int i = 0; i < iC; ++i) {
        cout << C[i] << " ";
    }

    cout << endl;

    return 0;
}
